; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-3-5)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-2 - location
	p0-6 - location
	p1-0 - location
	p2-0 - location
	p2-4 - location
	p3-0 - location
	p4-0 - location
	p4-5 - location
	p4-6 - location
	p5-4 - location
	p6-1 - location
	p6-3 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s5)
	(at driver3 s2)
	(at driver4 s1)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s6)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s6)
	(at package2 s1)
	(at package3 s4)
	(at package4 s1)
	(at package5 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 66)
	(= (time-to-drive s6 s0) 66)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 57)
	(= (time-to-drive s3 s1) 57)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 56)
	(= (time-to-drive s4 s1) 56)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 40)
	(= (time-to-drive s0 s2) 40)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 1)
	(= (time-to-drive s1 s2) 1)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 76)
	(= (time-to-drive s3 s2) 76)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 93)
	(= (time-to-drive s0 s3) 93)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 37)
	(= (time-to-drive s6 s3) 37)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 1)
	(= (time-to-drive s2 s4) 1)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 23)
	(= (time-to-drive s3 s4) 23)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 93)
	(= (time-to-drive s5 s4) 93)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 14)
	(= (time-to-drive s1 s5) 14)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 86)
	(= (time-to-drive s2 s6) 86)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 31)
	(= (time-to-drive s5 s6) 31)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s1)
	(at driver3 s5)
	(at driver4 s4)
	(at truck2 s3)
	(at package1 s1)
	(at package2 s6)
	(at package3 s5)
	(at package4 s3)
	(at package5 s2)
	))

(:metric minimize (+ (* 4 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver4 truck3 s1)
   deleted: (at driver4 s1) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 0 of 9
2. (load-truck package4 truck3 s1)
   deleted: (at package4 s1)
   added: (in package4 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 0 of 9
3. (load-truck package5 truck3 s1)
   deleted: (at package5 s1)
   added: (in package5 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 0 of 9
4. (load-truck package2 truck3 s1)
   deleted: (at package2 s1)
   added: (in package2 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 0 of 9
5. (drive-truck truck3 s1 s4 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (fuel-used) from 0 to 896
   goals met: 0 of 9
6. (load-truck package3 truck3 s4)
   deleted: (at package3 s4)
   added: (in package3 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 0 of 9
7. (drive-truck truck3 s4 s3 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (fuel-used) from 896 to 1356
   goals met: 0 of 9
8. (drive-truck truck3 s3 s6 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (fuel-used) from 1356 to 2096
   goals met: 0 of 9
9. (unload-truck package2 truck3 s6)
   deleted: (in package2 truck3)
   added: (at package2 s6)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 1 of 9
10. (load-truck package1 truck3 s6)
   deleted: (at package1 s6)
   added: (in package1 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 1 of 9
11. (drive-truck truck3 s6 s3 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   changed: (fuel-used) from 2096 to 2836
   goals met: 1 of 9
12. (unload-truck package4 truck3 s3)
   deleted: (in package4 truck3)
   added: (at package4 s3)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 2 of 9
13. (drive-truck truck3 s3 s1 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (fuel-used) from 2836 to 3748
   goals met: 2 of 9
14. (unload-truck package1 truck3 s1)
   deleted: (in package1 truck3)
   added: (at package1 s1)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 3 of 9
15. (drive-truck truck3 s1 s5 driver4)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 3748 to 3930
   goals met: 3 of 9
16. (unload-truck package3 truck3 s5)
   deleted: (in package3 truck3)
   added: (at package3 s5)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 4 of 9
17. (walk driver3 s2 p2-4)
   deleted: (at driver3 s2)
   added: (at driver3 p2-4)
   goals met: 4 of 9
18. (drive-truck truck3 s5 s4 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 3930 to 4953
   goals met: 4 of 9
19. (walk driver3 p2-4 s4)
   deleted: (at driver3 p2-4)
   added: (at driver3 s4)
   goals met: 4 of 9
20. (walk driver3 s4 p4-5)
   deleted: (at driver3 s4)
   added: (at driver3 p4-5)
   goals met: 4 of 9
21. (walk driver3 p4-5 s5)
   deleted: (at driver3 p4-5)
   added: (at driver3 s5)
   goals met: 5 of 9
22. (drive-truck truck3 s4 s5 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 4953 to 5976
   goals met: 5 of 9
23. (drive-truck truck3 s5 s6 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 5976 to 6317
   goals met: 5 of 9
24. (disembark-truck driver4 truck3 s6)
   deleted: (driving driver4 truck3)
   added: (at driver4 s6) (empty truck3)
   goals met: 5 of 9
25. (board-truck driver4 truck2 s6)
   deleted: (at driver4 s6) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 5 of 9
26. (unload-truck package5 truck3 s6)
   deleted: (in package5 truck3)
   added: (at package5 s6)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 5 of 9
27. (load-truck package5 truck2 s6)
   deleted: (at package5 s6)
   added: (in package5 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 9
28. (drive-truck truck2 s6 s3 driver4)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   changed: (fuel-used) from 6317 to 6724
   goals met: 6 of 9
29. (walk driver2 s5 p4-5)
   deleted: (at driver2 s5)
   added: (at driver2 p4-5)
   goals met: 6 of 9
30. (drive-truck truck2 s3 s2 driver4)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 6724 to 7560
   goals met: 5 of 9
31. (unload-truck package5 truck2 s2)
   deleted: (in package5 truck2)
   added: (at package5 s2)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 9
32. (drive-truck truck2 s2 s4 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (fuel-used) from 7560 to 7570
   goals met: 6 of 9
33. (walk driver2 p4-5 s5)
   deleted: (at driver2 p4-5)
   added: (at driver2 s5)
   goals met: 6 of 9
34. (drive-truck truck2 s4 s5 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (fuel-used) from 7570 to 8500
   goals met: 6 of 9
35. (disembark-truck driver4 truck2 s5)
   deleted: (driving driver4 truck2)
   added: (at driver4 s5) (empty truck2)
   goals met: 6 of 9
36. (board-truck driver1 truck2 s5)
   deleted: (at driver1 s5) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 9
37. (walk driver4 s5 p4-5)
   deleted: (at driver4 s5)
   added: (at driver4 p4-5)
   goals met: 6 of 9
38. (walk driver4 p4-5 s4)
   deleted: (at driver4 p4-5)
   added: (at driver4 s4)
   goals met: 7 of 9
39. (drive-truck truck2 s5 s1 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 8500 to 8640
   goals met: 7 of 9
40. (drive-truck truck2 s1 s3 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 8640 to 9210
   goals met: 8 of 9
41. (walk driver2 s5 p4-5)
   deleted: (at driver2 s5)
   added: (at driver2 p4-5)
   goals met: 8 of 9
42. (walk driver2 p4-5 s4)
   deleted: (at driver2 p4-5)
   added: (at driver2 s4)
   goals met: 8 of 9
43. (board-truck driver2 truck1 s4)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 8 of 9
44. (drive-truck truck1 s4 s1 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 9210 to 9770
   goals met: 8 of 9
45. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 9 of 9
